Revit 2027 API
BuiltInFailures.RebarCouplerFailures.EngagementBiggerThanLengthWarning Property
 This is used to post warning. The sum of bar engagements is greater than the total coupler length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EngagementBiggerThanLengthWarning { get; }
Public Shared ReadOnly Property EngagementBiggerThanLengthWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EngagementBiggerThanLengthWarning {
	FailureDefinitionId^ get ();
}
static member EngagementBiggerThanLengthWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace